package service;

/**数据类
 * @author LiuJun
 * @create 2021-8-30-16:00
 */
public class Data {
    //代表不同的职位
    public static final int EMPLOYEE=10;
    public static final int PROGRAMMER=11;
    public static final int DESIGNER=12;
    public static final int ARCHITECT=13;

    //使用的工具
    public static final int PC=21;
    public static final int NOTEBOOK=22;
    public static final int PRINTER=23;


    public static final String[][] EMPLOYEES= {
            {"10","1","马云","22","3000"},
            {"10","2","林政楠","22","4000"},
            {"13","3","马化腾","32","18000","15000","2000"},
            {"11","4","李彦宏","23","7000"},
            {"11","5","刘强东","24","7300"},
            {"12","6","雷军","28","10000","5000"},
            {"11","7","任志强","22","6800"},
            {"12","8","柳传志","29","10800","5200"},
            {"13","9","杨元庆","30","19800","15000","2500"},
            {"12","10","史玉柱","26","9800","5500"},
            {"11","11","丁磊","21","6600"},
            {"11","12","张朝阳","25","7100"},
            {"12","13","杨致远","27","9600","4800"},
    };



    public static final String[][] EQUIPMENTS= {
            {},
            {"22","联想T4","6000"},
            {"21","戴尔","NEC17寸"},
            {"21","戴尔","三星 17寸"},
            {"23","佳能2000","激光"},
            {"21","华硕","三星 17寸"},
            {"21","华硕","三星 17寸"},
            {"23","爱普生20寸","针式"},
            {"22","惠普m6","5800"},
            {"21","戴尔","NEC 17寸"},
            {"21","华硕","三星 17寸"},
            {"23","爱普生20寸","针式"},
            {"22","惠普m6","5800"},
    };


}
